Repository: Ahmed-Abdelhamid0/RealTime-DB-with-Notification
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Appearance
ar: المظهر

source: Light
ar: فاتح

source: Dark
ar: داكن

source: System
ar: حسب النظام

# activate_title
source: Activate
ar: مُفعل

source: Shake Device To
ar: حرّك الجهاز لـ

source: Apply for Current Account
ar: فتح حساب جاري جديد

source: Apply for Saving Account
ar: فتح حساب توفير جديد

source: Deduct From
ar: خصم من

source: Interest
ar: الفائدة

source: Current Account Opened Successfully
ar: تم فتح الحساب الجاري بنجاح

source: Saving Account Opened Successfully
ar: تم فتح حساب التوفير بنجاح

source: Opening Amount
ar: مبلغ فتح الحساب

# opening_amount_cd
source: Opening Amount
ar: مبلغ فتح الشهادة

# opening_amount_td
source: Opening Amount
ar: مبلغ فتح الوديعة

# add_more_and_enjoy
source: Add {amount} more and enjoy
ar: أضف {amount} أو أكثر واستمتع بفائدة

source: View Account
ar: عرض الحساب

source: Less than
ar: أقل من

source: Know More
ar: اعرف أكثر

source: and above
ar: وأكثر

source: For
ar: ل

source: Interest Details
ar: تفاصيل الفائدة

source: Chequebook available for all accounts.
ar: دفتر الشيكات متاح لجميع الحسابات.

source: Collateral Details
ar: تفاصيل الضمانات

# message_collateral_details
source: Review the deposits and certificates used as collateral for your loan.
ar: قم بمراجعة الودائع والشهادات المستخدمة كضمان لقرضك.

source: Total blocked amount
ar: إجمالي المبلغ المحجوز

source: Multiple
ar: متعددة

# interest_and_amount_added_same_maturity_td
source: Interest and amount will be added to the same account at maturity.
ar: ستُضاف الفائدة ومبلغ الوديعة عند الاستحقاق إلى نفس الحساب.

# interest_and_amount_added_same_maturity_cd
source: Interest and amount will be added to the same account at maturity.
ar: ستُضاف الفائدة ومبلغ الشهادة عند الاستحقاق إلى نفس الحساب.

source: Select Duration
ar: اختر المدة

source: Select Frequency
ar: اختر الفائدة

source: Paid After Maturity
ar: تُدفع عند الاستحقاق

source: Interest Amount
ar: قيمة الفائدة

# not_eligible_for
source: Not eligible for {productType}
ar: غير متاح ل {productType}

# not_eligible_for_description
source: {productType} are currently not available for {currency} currency.
ar: {productType} غير متاحة للعملة {currency}.

source: Benefits
ar: فوائد

# cd_td_benefits_1
source: Ability to issue certificates via mobile banking service.
ar: القدرة على إصدار الشهادات عبر خدمة الخدمات المصرفية عبر الهاتف المحمول.

# cd_td_benefits_2
source: Interest calculated from the next working day of issuance date.
ar: يتم احتساب الفائدة اعتبارًا من يوم العمل التالي لتاريخ الإصدار.

# cd_td_benefits_3
source: Eligible to borrow up to 90% of its value.
ar: مؤهلة لاقتراض ما يصل إلى 90٪ من قيمتها.

# cd_td_benefits_4
source: Eligible to get Suez Canal Bank's credit cards with Certificate guarantee.
ar: مؤهل للحصول على بطاقات الائتمان من بنك قناة السويس مع ضمان الشهادة.

source: Deducted account
ar: خصم من

# cancel_product
source: Cancel {productType}
ar: إلغاء {productType}

source: Certificate Opened Successfully
ar: تم فتح الشهادة بنجاح

source: Time Deposit Opened Successfully
ar: تم فتح الوديعة بنجاح

source: Certificate Number
ar: رقم الشهادة

source: Certificate Amount
ar: مبلغ الشهادة

source: Certificate Details
ar: تفاصيل الشهادة

source: Time Deposit Details
ar: تفاصيل الوديعة

# received_interests
source: Received {received} of {total} interests.
ar: استملت {received} من {total} فائدة

# deposit_number
source: Time Deposit Number
ar: رقم الوديعة

# deposit_amount
source: Time Deposit Amount
ar: مبلغ الوديعة

source: View Time Deposit
ar: عرض الوديعة

source: View Certificate
ar: عرض الشهادة

source: Apply for Certificate
ar: فتح شهادة جديدة

# apply_for_time_deposit
source: Apply for Time Deposits
ar: فتح وديعة جديدة

source: Explore Our Variety of Products
ar: استكشف مجموعة منتجاتنا المتنوعة

source: Save money daily
ar: توفير المال يوميا

source: Everyday transactions
ar: المعاملات اليومية

source: Long term saving
ar: الادخار على المدى الطويل

source: Time limited saving
ar: الادخار بوقت محدد

source: Pay others
ar: ادفع للآخرين

# select_account_to_proceed
source: Select an account to proceed with the entered amount
ar: اختر حسابًا لخصم مبلغ فتح الحساب منه

# my_products_description
source: Access all your products in one place accounts, deposits, cards, and more.
ar: يمكنك الوصول إلى جميع منتجاتك في مكان واحد. الحسابات، الودائع، البطاقات، والمزيد.

source: View My Products
ar: مشاهدة منتجاتي

source: All
ar: الكل

# otp_support_message
source: Didn’t get the code? Call us at {supportNumber} for support.
ar: لم تحصل على الكود؟ اتصل بنا على {supportNumber} للحصول على الدعم.

# soft_support_message
source: Don’t know how to get it? Call us at 19093 for support.
ar: لم تحصل على الكود؟ اتصل بنا على {supportNumber} للحصول على الدعم.

source: Linked to
ar: الحساب المرتبط به

source: Number of Pages
ar: عدد الصفحات

# num_of_pages
source: {page} pages
ar: {page} صفحة

# num_of_pages_chequebook
source: {page} pages Chequebook
ar: دفتر شيكات {page} صفحة

source: Chequebook fees
ar: رسوم الإصدار

# this_is_your_home_branch
source: This is your home branch address
ar: هذا هو فرعك الرئيسي.

source: Change
ar: تغيير

source: Select Branch
ar: اختيار الفرع

# your_cheque_request_received
source: Chequebook Ordered Successfully
ar: تم طلب دفتر الشيكات بنجاح

source: Pickup from
ar: إستلام من

source: Chequebook Number
ar: رقم دفتر الشيكات

# fees_value
source: Fee: {fees}
ar: الرسوم: {fees}

source: Total accounts balance
ar: إجمالي رصيد الحسابات

source: Shake device to Quick Access
ar: حرّك الجهاز للوصول السريع

# shake_message_description
source: Shake your phone anytime to open shortcuts instantly, anywhere in the app.
ar: قم بتحريك هاتفك في أي وقت لفتح الاختصارات فورًا من أي مكان في التطبيق.

source: Select Preferred Action
ar: اختر الإجراء المفضل

source: Choose Transfer Type
ar: اختر نوع التحويل

source: Own Transfer
ar: تحويل شخصي

source: Normal Local Transfer
ar: تحويل محلي عادي

source: Explore New Products
ar: اكتشف منتجاتنا الجديدة

# we_could_not_load_your_list
source: We couldn't reload your list
ar: لم نتمكن من إعادة تحميل قائمتك

# you_do_not_have_certificates
source: You don't have any certificates yet
ar: ليس لديك أي شهادات حتى الآن

# you_do_not_have_time_deposits
source: You don't have any time deposits yet
ar: ليس لديك أي ودائع حتى الآن

# once_apply_appear_here
source: Once you apply for new, it will appear here.
ar: بمجرد فتح وديعة جديدة، ستظهر هنا.

source: No certificate
ar: ليس لديك أي شهادات

source: No time deposit
ar: ليس لديك أي ودائع

# no_certificate_available_for_currency
source: No certificate available for this currency
ar: لا توجد لديك شهادات لهذه العملة.

# no_time_deposit_available_for_currency
source: No time deposits available for this currency
ar: لا توجد لديك ودائع لهذه العملة.

# see_all_currency_certificates
source: See certificate in all currencies
ar: عرض الشهادات بجميع العملات

# see_all_currency_time_deposits
source: See deposits in all currencies
ar: عرض الودائع بجميع العملات

source: Total certificate balance
ar: إجمالي رصيد الشهادات

source: Total time deposit balance
ar: إجمالي رصيد الودائع

source: Total Balance Overview
ar: نظرة عامة على الرصيد الإجمالي

# total_balance_overview_description
source: Your total balance shows all your funds across currencies and product types. Equivalent values depend on the latest available exchange rates at the last update.
ar: يُظهر رصيدك الإجمالي جميع أموالك بمختلف العملات وأنواع المنتجات. تعتمد قيمة العملة على أحدث أسعار الصرف المتاحة في التحديث الأخير.

source: View Exchange Rate
ar: عرض سعر الصرف

# you_do_not_have_products
source: You don't have any {productType} yet
ar: ليس لديك أي {productType} حتى الآن

# see_all_currency_products
source: See {productType} in all currencies
ar: عرض {productType} بجميع العملات

# no_product_available_for_currency
source: No {productType} available for this currency
ar: لا توجد {productType} لهذه العملة

source: Select Account Type
ar: اختر نوع الحساب

# saving_account_only
source: Saving Account
ar: حساب توفير

# current_account_only
source: Current Account
ar: حساب جاري

# apply_for_new_my_products
source: Apply for new
ar: فتح شهادة جديدة

source: Up to
ar: تصل لـ

source: Shake to go!
ar: حرّك الجهاز للوصول السريع

# shake_description
source: Just shake your device anytime to instantly access key actions—anywhere in the app. It’s fast, easy, and always ready. You can manage it in Settings.
ar: حرك جهازك في أي وقت للوصول فورًا إلى الإجراءات الرئيسية من أي مكان في التطبيق. الأمر سريع وسهل ودائمًا جاهز. يمكنك إدارته من الإعدادات.

source: Let’s do it
ar: هيا بنا

source: Time Deposits
ar: الودائع

source: Chequebooks
ar: دفاتر الشيكات

# you_do_not_have_loans
source: You don't have any loans yet
ar: ليس لديك أي قروض حتى الآن

source: Total loans balance
ar: إجمالي رصيد القروض

# loan_no_placeholder
source: Loan No. {accountId}
ar: رقم القرض: {accountId}

# you_do_not_have_chequebooks
source: You don't have any chequebooks yet
ar: ليس لديك أي دفتر شيكات حتى الآن

# once_you_request_chequebook
source: Once you request a new one, it will appear here.
ar: بمجرد التقديم على دفتر شيكات جديد، سيظهر هنا.

# remaining_leaves
source: {remaining} Remaining
ar: {remaining} متبقي

source: Request new
ar: التقديم على دفتر جديد

# remaining_cheque
source: Remaining
ar: متبقي

# chequebook_summary_fees
source: Fees
ar: رسوم الإصدار

# you_do_not_have_cards
source: You don't have any cards yet
ar: ليس لديك أي بطاقات حتى الآن

# once_you_request_card
source: Once you request a new one, it will appear here.
ar: بمجرد التقديم على بطاقة جديدة، ستظهر هنا.

# until
source: Until: {date}
ar: حتى: {date}

# apply_for_time_deposits
source: Apply for new
ar: فتح وديعة جديدة

# once_apply_loan_appear
source: Once you apply it, it will appear here.
ar: بمجرد التقديم على قرض جديد، سيظهر هنا.

# loan_paid
source: Paid
ar: مدفوع

# loan_details_action
source: Details
ar: تفاصيل

# dont_show_again_shake
source: Don’t Show Again!
ar: عدم الإظهار مجددًا

source: No cards
ar: لا توجد بطاقات

# no_cards_currency
source: No cards available for this currency
ar: لا توجد بطاقات متاحة لهذه العملة.

# see_cards_currency
source: See cards in all currencies
ar: عرض البطاقات بجميع العملات

source: Pending Transactions
ar: معاملات قيد الانتظار

source: Actual Balance
ar: الرصيد الفعلي

source: Make Transfers
ar: إرسال تحويلات

source: Set Default
ar: التعيين كأساسي

source: View Statements
ar: كشوفات الحساب

# account_number_hint
source: You can find your account number on bank statements. If you need help, call us at {number}.
ar: يمكنك العثور على رقم حسابك في كشوفات البنك. إذا كنت بحاجة إلى مساعدة، يرجى الاتصال بنا على {number}.

# account_number_register_invalid
source: Account number is invalid
ar: رقم الحساب غير صحيح

# national_id_invalid
source: National ID / Passport number is invalid
ar: رقم بطاقة الرقم القومي/ رقم جواز السفر غير صالح

# cif_number_invalid
source: CIF number is invalid
ar: الرقم التعريفى للعميل غير صحيح

# invalid_error_message
source: Some of the entered data is invalid, please re-check and try again. For assistance, contact us at ({number}).
ar: بعض البيانات المدخلة غير صحيحة. يرجى التحقق مرة أخرى والمحاولة مجددًا. للمساعدة، تواصل معنا على ({number}).

source: Terms not accepted
ar: لم يوافق على الشروط

source: Registration
ar: التسجيل

# set_default_button
source: Set Default
ar: تعيين كأساسي

source: Default Account
ar: الحساب الافتراضي

# un_set_default_confirmation_message
source: Are you sure you want to unset this account as default account?
ar: هل أنت متأكد أنك تريد إلغاء تعيين هذا الحساب كحساب أساسي؟

# set_default_confirmation_message
source: Are you sure you want to make this your default account?
ar: هل أنت متأكد أنك تريد تعيين هذا الحساب كحساب أساسي؟

source: Unset Default
ar: إلغاء التعيين كأساسي

source: Account Unset Successfully
ar: تم إلغاء تعيين الحساب بنجاح

source: Account Set Successfully
ar: تم تعيين الحساب الأساسي بنجاح

# account_set_successfully_message
source: You can use this account as your default account.
ar: يمكنك استخدام هذا الحساب كحساب أساسي.

source: Can’t Set as Default
ar: لا يمكن تعيينه كحساب أساسي

# can_t_set_as_default_message
source: You can’t set this account as a default because it’s in a different currency, please choose an EGP account to set as a default.
ar: لا يمكنك تعيين هذا الحساب كحساب أساسي لأنه بعملة مختلفة، يرجى اختيار حساب جنيه مصري لتعيينه كحساب أساسي.

source: Default
ar: أساسي

source: New user? Register
ar: تسجيل مستخدم جديد

# i_agree_button
source: I Agree
ar: أوافق

# terms_and_conditions_agreement_registration
source: I have read and agreed to
ar: لقد قرأت وأوافق على

# cancellation
source: Cancel
ar: إلغاء

source: Papers
ar: صفحة

source: Total Pages
ar: إجمالي الصفحات

source: Linked Account
ar: الحساب المرتبط به

source: Amount Received
ar: تم استقبال المبلغ

source: Amount Deducted
ar: تم خصم المبلغ

source: Ref ID:
ar: الرقم المرجعي:

source: Transaction Details
ar: تفاصيل المعاملة

# transaction_receipt_powered_by
source: Powered by Suez Canal Bank
ar: بواسطة بنك قناة السويس

# credited_amount_title
source: Credited amount
ar: المبلغ المحول

source: Action After Maturity
ar: الإجراء عند الاستحقاق

# maturity_renew
source: Renew
ar: تجديد

# maturity_not_renew
source: Do Not Renew
ar: عدم التجديد

# maturity_change
source: Change
ar: تغيير

source: Save
ar: حفظ

source: Upcoming Installment
ar: القسط القادم

source: Installment Date
ar: تاريخ استحقاق القسط

source: Upcoming Interest
ar: الفائدة القادمة

# certificate_start_date
source: Start Date
ar: تاريخ فتح الشهادة

# td_start_date
source: Start Date
ar: تاريخ فتح الوديعة

# td_end_date
source: End Date
ar: تاريخ انتهاء الوديعة

# certificate_end_date
source: End Date
ar: تاريخ الانتهاء

source: Do Not Renew
ar: عدم التجديد

# renew_description
source: Certificate will be redeemed at maturity
ar: سيتم استرداد الشهادة عند الاستحقاق

source: Time Deposit Amount
ar: مبلغ الوديعة

source: Pay Next
ar: سداد البطاقة

source: Card due
ar: مستحقات البطاقة

# utilised_limit
source: Utilized limit
ar: الرصيد المستخدم

source: Card total limit:
ar: الحد الأقصى للبطاقة:

source: Cardholder name
ar: اسم حامل البطاقة

source: Expiry date
ar: تاريخ الانتهاء

source: Clearing Status
ar: حالة المقاصة

source: Cheque Number
ar: رقم الشيك

source: Issuer Bank
ar: البنك المُصدر

source: Share transaction
ar: مشاركة المعاملة

# deposit_number_title
source: Deposit Number
ar: رقم الشهادة

# paid_out_of_installments
source: Paid {paidInstallments} of {totalInstallments} installments
ar: تم دفع {paidInstallments} من {totalInstallments} قسط

source: Loan amount
ar: قيمة القرض

source: Loan Installments
ar: أقساط القرض

# review_upcoming_and_past_installments
source: Review your upcoming and past installments
ar: مراجعة أقساطك القادمة والسابقة

source: Next Installment
ar: القسط القادم

source: Loan Number
ar: رقم القرض

source: Total Overdue
ar: إجمالي المبلغ المتأخر

source: Due Interest
ar: الفائدة المُستحقة

source: Penalties
ar: غرامات

# installments_num
source: {num} Installments (Principal)
ar: {num} أقساط (أصل المبلغ)

# maturity_update_success_title
source: Maturity Action Update
ar: تم تحديث الإجراء عند الاستحقاق

# maturity_update_success_subtitle
source: Your maturity action has been updated successfully. Please note that The update may take some time to appear, so please check again later to confirm.
ar: تم تحديث إجراء الاستحقاق بنجاح. وقد يتأخر ظهور التحديث قليلًا. لذا يُرجى إعادة التحقق لاحقًا للتأكيد.

# maturity_update_fail_title
source: Update Failed
ar: فشل التحديث

# maturity_update_fail_subtitle
source: We couldn’t update your maturity action at the moment.
ar: لم نتمكن من تحديث إجراء الاستحقاق الخاص بك في الوقت الحالي.

# maturity_update_success
source: You have successfully updated your maturity instructions.
ar: لقد تم تحديث تعليمات الاستحقاق الخاصة بك بنجاح.

# maturity_update_fail
source: We couldn’t update your maturity instructions.
ar: لم نتمكن من تحديث تعليمات الاستحقاق الخاصة بك.

source: Description
ar: الوصف

# set_default_button_title
source: Set Default
ar: التعيين كحساب أساسي

# un_set_default_button_title
source: Unset Default
ar: إلغاء كحساب أساسي

source: ATM Location
ar: موقع الصراف الآلي

source: ATM ID
ar: معرف الصراف الآلي

source: Merchant Name
ar: اسم التاجر

source: Branch Name
ar: اسم الفرع

# depositor_name
source: Depositor’s Name
ar: اسم المودع

source: Withdrawal’s Name
ar: اسم الساحب

# action_after_maturity_td_sub_title
source: You can change that until 2 days from the maturity date.
ar: يمكنك تغيير ذلك حتى يومين من تاريخ الاستحقاق.

# action_after_maturity_td_opening_message
source: You can change that after opening.
ar: يمكنك تغيير ذلك بعد فتح الوديعة.

# action_after_maturity_cd_sub_title
source: You can change this option once per day, until 2 days before the maturity date.
ar: يمكنك تغيير هذا الخيار مرة واحدة يوميًا، حتى قبل يومين من تاريخ الاستحقاق

# action_after_maturity_cd_opening_message
source: You can update this after opening your certificate.
ar: يمكنك تحديث هذا بعد فتح شهادتك

source: Reference ID
ar: الرقم المرجعي

source: Unpaid
ar: غير مدفوع

# upcoming_loan_installments
source: Upcoming
ar: القادمة

# loan_detail_paid
source: Paid
ar: المدفوع

# loan_remaining
source: Remaining
ar: المتبقي

# loan_due_date
source: Due Date:
ar: تاريخ الدفع:

# could_not_verify_soft_token_status_message
source: We couldn’t verify your soft token status. Please try again in a moment.
ar: تعذّر علينا التحقق من حالة الرمز الآمن (Soft Token). يرجى المحاولة مرة أخرى بعد قليل.

# something_went_wrong_dialog
source: Something went wrong
ar: حدث خطأ!

# maturity_action_update_note
source: Please note that the update may take some time to appear, so please check again later to confirm.
ar: قد يتأخر ظهور التحديث بعض الوقت. يرجى التحقق لاحقًا للتأكيد.

# maturity_update_success_title_note
source: Maturity Action Update
ar: تحديث الإجراء عند الاستحقاق

# soft_token_already_active
source: Your Soft Token is Already Active
ar: رمز الأمان الخاص بك مُفعل بالفعل

# facing_issues_help
source: Facing issues? Just De-activate your token anytime.
ar: هل تواجه مشكلة؟ ما عليك سوى إعادة تفعيل الرمز الخاص بك في أي وقت.

source: Deactivation Completed
ar: اكتمل إلغاء التفعيل

# deactivation_desc
source: Your token is successfully deactivated. you can activate it again anytime.
ar: تم إلغاء تفعيل الرمز الخاص بك بنجاح. يمكنك تفعيله مرة أخرى في أي وقت.

source: Keep in Mind
ar: تذكّر دائمًا

# you_can_activate_soft_token_again
source: You can activate your soft token again anytime from the More menu.
ar: بإمكانك تفعيل رمز الأمان الخاص بك مرة أخرى في أي وقت من قائمة المزيد.

source: Soft Token Status
ar: حالة رمز الأمان غير متاحة

# soft_token_status_desc
source: Soft Token status is not available at the moment, please try again in a few minutes.
ar: حالة رمز الأمان غير متاحة في الوقت الحالي، يرجى المحاولة مرة أخرى بعد بضع دقائق.

source: Unavailable
ar: غير متاح

# deactivation_failed_desc
source: We couldn’t complete your request. Please try again later.
ar: لم نتمكن من إكمال طلبك لفتح المنتج. يرجى المحاولة مرة أخرى لاحقًا.

# something_went_wrong_operation
source: Something went wrong!
ar: لقد حدث خطأ ما!

# done_operation
source: Done
ar: حسنًا

# cancel_deactivation_dialog
source: Cancel
ar: تجاهل

source: Download E-Statement
ar: تحميل كشف الحساب

source: Monthly Statements
ar: الكشوفات الشهرية

source: Select Statement Year
ar: اختر السنة

source: (Current year)
ar: السنة الحالية

# no_statements_found
source: No statements available
ar: لا يوجد كشوفات حساب متاحة

# no_statements_found_subtitle
source: You don’t have any e-statement subscriptions for this year.
ar: ليس لديك أي اشتراكات في كشوفات الحساب لهذا العام.

# choose_year_to_see_statements
source: Choose a year to see available statements.
ar: اختر السنة لعرض الكشوفات المتاحة.

# could_not_load_statements
source: We couldn’t load your E-Statement
ar: لم نتمكن من تحميل التحويلات

source: Year
ar: السنة

source: Transferred Successfully
ar: تم التحويل بنجاح

source: Claim offer
ar: الحصول على العرض

source: Your promo code
ar: كود العرض

source: Copy code
ar: نسخ الكود

source: Eligible cards
ar: البطاقات المؤهلة للعرض

source: Fashion
ar: الملابس

source: Automotive
ar: السيارات

source: Electronics
ar: الإلكترونيات

source: Furniture
ar: الأثاث

source: Gifts
ar: الهدايا

source: Health Care
ar: الرعاية الصحية

source: Installments
ar: التقسيط

source: Online applications
ar: التطبيقات الإلكترونية

source: Restaurants
ar: المطاعم

source: Stationary
ar: المكتبات

source: Travel
ar: السفر

# empty_offers
source: No offers yet
ar: لا يوجد عروض

# empty_offers_content
source: Offers will appear here once available.
ar: ستظهر العروض هنا بمجرد توفرها.
