Repository: Ahmed-Abdelhamid0/RealTime-DB-with-Notification
Catalog: lib/l10n/app_*.arb
Languages: ar

# not_eligible_request_msg
source: You’re Not Eligible to Request a Chequebook
ar: لا يحق لك طلب دفتر شيكات

source: Deposit Details
ar: تفاصيل الشهادة

# deposit_no
source: Deposit no. {number}
ar: رقم الوديعة: {number}

# certificate_no
source: Certificate no. {number}
ar: رقم الشهادة: {number}

# months_left
source: /{number} Months
ar: /{number} شهر

source: Redeemed Account
ar: الحساب المُستَرد

source: Interest Account
ar: حساب الفائدة

source: Payout Details
ar: تفاصيل الصرف

source: Interest Frequency
ar: تكرار الفائدة

source: Blocked Amount
ar: المبلغ المحجوز

# percent_rate_with_type
source: {rate}% {type} rate
ar: معدل {type} {rate}%

source: Loan no.
ar: رقم القرض

source: Chequebook Details
ar: تفاصيل دفتر الشيكات

source: Used
ar: مستخدم

source: Used Cheques
ar: الشيكات المستخدمة

source: Execution blocked
ar: تم حظر التنفيذ

source: Select Service
ar: اختر الخدمة

source: Chequebook
ar: دفتر الشيكات

source: My Products
ar: منتجاتي

source: Products
ar: المنتجات

# empty_chequebooks_msg
source: No chequebooks yet
ar: لا توجد دفاتر شيكات بعد

# error_chequebooks_msg
source: We couldn{shortcut}t load your chequebooks
ar: لم نتمكن من تحميل دفاتر الشيكات الخاصة بك

# empty_used_cheques_msg
source: No used cheques yet
ar: لا توجد شيكات مستخدمة بعد

# error_used_cheques_msg
source: We couldn{shortcut}t load your cheques
ar: لم نتمكن من تحميل قائمة الشيكات الخاصة بك

source: Loans
ar: القروض

# we_could_not_load_your_loans
source: We couldn't load your loans
ar: لم نتمكن من تحميل القروض

# we_could_not_load_your_payments
source: We couldn't load your payments
ar: لم نتمكن من تحميل المدفوعات

source: Saving Accounts
ar: حسابات التوفير

# saving_account
source: Savings Account
ar: حسابات جارية

source: Current Affairs
ar: حسابات توفير

# time_deposits
source: Time Deposit
ar: الودائع

source: Certificates
ar: الشهادات

source: History
ar: السابق

source: In progress
ar: قيد التنفيذ

source: Rejected
ar: مرفوض

source: Delivered
ar: تم التسليم

source: Request date and time
ar: تاريخ الطلب

source: Request no.
ar: رقم الطلب

# empty_requests_msg
source: No requests yet
ar: لا توجد طلبات بعد

# error_requests_msg
source: We couldn{shortcut}t load your requests
ar: لم نتمكن من تحميل الطلبات الخاصة بك

source: Funding Details
ar: تفاصيل التمويل

source: Deposit Account
ar: حساب الوديعة

# amount_only
source: Amount
ar: المبلغ

# minimum_certificate_amount_is
source: The minimum certificate amount is {amount} and its multiples
ar: الحد الأدنى لقيمة الشهادة هو {amount} ومن مضاعفاتها

# minimum_amount_is
source: The minimum opening amount is {amount} {currency}
ar: {currency} {amount} الحد الأدنى

source: Deposits
ar: شهادات

# deposits_dashboard
source: Deposits
ar: شهادات و ودائع

source: No products found
ar: لا توجد منتجات

# up_to_interest_rate
source: Up to
ar: تصل إلى

source: Cheques
ar: دفتر الشيكات

source: Not Available
ar: غير متاح

source: Available
ar: متاح

source: Amount
ar: المبلغ

# minimum_opening_amount_is
source: Minimum opening amount is {amount} {currency}
ar: الحد الأدنى لمبلغ فتح الشهادة هو {amount} {currency}

# minimum_opening_amount_td_is
source: Minimum opening amount is {amount} {currency}
ar: الحد الأدنى لمبلغ فتح الوديعة هو {amount} {currency}

# minimum_opening_amount_cd_is
source: Minimum opening amount is {amount} {currency}
ar: الحد الأدنى لمبلغ فتح الشهادة هو {amount} {currency}

# minimum_with_amount_and_currency
source: Minimum {amount} {currency}
ar: الحد الأدنى للمبلغ هو {amount} {currency}

source: Account Opened successfully
ar: تم فتح الحساب بنجاح

# terms_and_conditions_agreement_required
source: You need to agree to the terms and conditions to continue.
ar: يجب أن توافق على الشروط والأحكام للاستمرار.

source: Duration
ar: المدة

source: Frequency
ar: معدل الفائدة

source: Added
ar: تم الإضافة

source: Overdue Amount
ar: المبلغ المتأخر

# multiple_of_minimum_amount_td
source: Opening amount must be {amount} {currency} and its multiplies
ar: يجب أن يكون مبلغ فتح الوديعة {amount} {currency} ومضاعفاته

# multiple_of_minimum_amount_cd
source: Opening amount must be {amount} {currency} and its multiplies
ar: يجب أن يكون مبلغ فتح الشهادة {amount} {currency} ومضاعفاته

source: No accounts found
ar: لم يتم العثور على حسابات

source: No cards found
ar: لم يتم العثور على بطاقات

source: No deposit accounts found
ar: لم يتم العثور على حسابات الودائع

source: Credit Card Payment
ar: سداد بطاقة الائتمان

source: Deduct amount from
ar: خصم المبلغ من

source: Payment amount
ar: مبلغ السداد

source: Full Due Amount:
ar: إجمالي المبلغ المستحق:

source: Min Due Amount:
ar: الحد الأدنى للمبلغ المستحق:

source: Other Amount
ar: مبلغ آخر

source: Debited amount
ar: المبلغ المٌحول

source: No results found
ar: لا يوجد نتائج

source: Transactions List
ar: قائمة المعاملات

source: Transaction limit exceeded
ar: تم تجاوز حد التحويل

source: Reference
ar: الرقم المرجعي

source: Date
ar: التاريخ

source: Transfer to Charity
ar: تحويل إلى جمعية خيرية

source: Select Charity
ar: اختر الجمعية الخيرية

source: Charity
ar: جمعية خيرية

# this_field_is_required
source: This filed is required
ar: هذا الحقل مطلوب

source: Transaction Type
ar: نوع المعاملة

source: Wallet number
ar: رقم المحفظة

source: Mobile number
ar: رقم الهاتف المحمول

# mobile_no_is_invalid
source: Mobile number is invalid
ar: رقم الهاتف غير صحيح

# wallet_no_is_valid
source: Wallet number is invalid
ar: رقم المحفظة غير صحيح

# ipn_address
source: IPA Address
ar: عنوان الدفع

# ipn_address_invalid
source: IPA address is invalid
ar: عنوان الدفع الفورى غير صحيح

# amount_must_be_greater_than_min_due_amount
source: Amount must be greater than {minAmount}
ar: يجب أن يكون المبلغ أكبر من {minAmount}

source: Savings
ar: توفير

source: Change Password
ar: تغيير كلمة المرور

# change_pass_page_msg
source: Enter unique password. keep them confidential. you will need them for future logins.
ar: يرجى إدخال كلمة مرور قوية وفريدة، واحتفظ بها لاستخدامها لاحقًا عند تسجيل الدخول.

source: Debited account
ar: حساب الخصم

source: Min. Amount
ar: الحد الادنى

# no_min_amount
source: No Minimum amount
ar: بدون حد أدنى

# disclaimer_minimum_amount_is_and_its_multiples
source: The minimum {type} amount is {amount} and its multiples
ar: الحد الأدنى لقيمة {type} هو {amount} ومن مضاعفاتها

source: Deposit
ar: وديعة

source: Current password
ar: كلمة المرور الحالية

# current_password_invalid
source: Current password is invalid
ar: كلمة المرور الحالية غير صحيحة.

source: Successful Change!
ar: تم التغيير بنجاح!

# password_changed_successfully
source: The password is changed successfully.
ar: تم تغيير كلمة المرور بنجاح.

source: Login
ar: تسجيل الدخول

source: Contact Us
ar: تواصل معنا

source: Email
ar: البريد الإلكترونى

source: Website
ar: الموقع الإلكترونى

source: Call Center
ar: مركز الاتصال

source: Follow Us
ar: تابعنا

source: Online Support
ar: الدعم عبر الإنترنت

# exchange_rate_
source: Exchange Rates
ar: سعر الصرف

# last_update
source: Last Update: {time}
ar: آخر تحديث: {time}

source: Currency Converter
ar: تحويل عملة

source: EGP Exchange Rate
ar: السعر في الوقت الحالى

source: Buy
ar: شراء

source: Sell
ar: بيع

# selected_currency
source: Select Currency
ar: اختر العملة

# hide_balance_prompt_title_hidden
source: Balances are now hidden
ar: تم الآن إخفاء الأرصدة

# hide_balance_prompt_title_visible
source: Balances are now visible
ar: أصبحت الأرصدة مرئية الآن

# hide_balance_prompt_subtitle
source: Flip your screen down to quickly hide or show balances, or tap the eye icon above your balance
ar: اقلب الشاشة لأسفل لإخفاء أو عرض الرصيد، أو اضغط على رمز العين أعلى الرصيد.

source: Got it
ar: حسنًا

source: Don't show again
ar: لا تعرض هذا مرة أخرى

source: Hide Balance By Default
ar: إخفاء الرصيد بشكل افتراضى

source: Amount is required
ar: ادخل المبلغ

source: Interest account is required
ar: يجب تحديد حساب الفائدة

source: Opened successfully
ar: تم بنجاح

# cd_no
source: CD No. {number}
ar: رقم الشهادة. {number}

# td_no
source: TD No. {number}
ar: رقم الوديعة. {number}

source: Certificate
ar: الشهادة

source: Outside Egypt
ar: خارج مصر

# debited_account_is_required
source: Please select debited account first
ar: يجب تحديد حساب الخصم أولا

# maximum_amount_is
source: Max. {amount} {currency}
ar: الحد الأقصى. {amount} {currency}

# min_amount_is
source: Min. {amount} {currency}
ar: دقيقة. {amount} {currency}

# login_to_manage
source: Log in to manage your finances
ar: سجّل الدخول لإدارة أموالك

# new_password_field
source: New password
ar: كلمة المرور الجديدة

# confirm_new_password_field
source: Confirm new password
ar: تأكيد كلمة المرور الجديدة

# password_dn_match
source: Passwords don{shortcut}t match
ar: كلمات المرور غير متطابقة.

# current_pass_required
source: Current password is required
ar: كلمة المرور مطلوبة

# we_could_not_load_your_cards
source: We couldn't load your cards
ar: لم نتمكن من تحميل بطاقاتك

# we_could_not_load_your_accounts
source: We couldn't load your accounts
ar: لم نتمكن من تحميل حساباتك

# we_could_not_load_your_cd
source: We couldn’t load your Certificates
ar: لم نتمكن من تحميل الشهادات

# we_could_not_load_your_td
source: We couldn’t load your Tُُime deposits
ar: لم نتمكن من تحميل الودائع

source: Maichel
ar: مايكل

# we_could_not_load_offers
source: We couldn't load offers
ar: لم نتمكن من تحميل العروض

source: Edit Actions
ar: تعديل الإجراءات

source: Another Account
ar: حساب آخر

source: Are you sure you want to exit?
ar: هل أنت متأكد أنك تريد الخروج؟

# are_you_sure_you_want_to_exit_info
source: Closing will discard your changes
ar: سيؤدي الإغلاق إلى تجاهل التغييرات التي أجريتها

source: Request date
ar: تاريخ الطلب

source: Overdue days
ar: أيام التأخير

source: Frequently transferred to
ar: التحويلات المتكررة

source: One Time
ar: مرة واحدة

source: Recurring
ar: متكرر

source: Select Start Date
ar: اختر التاريخ

source: Number of occurrences
ar: عدد المرات

source: Daily
ar: يومى

source: Weekly
ar: أسبوعى

source: Monthly
ar: شهرى

source: Execution Date
ar: تاريخ التنفيذ

source: Occurrences
ar: عدد التحويلات

# times
source: {times} Times
ar: {times} مرات

source: Date of submission
ar: تاريخ الإنشاء

source: Date of execution
ar: تاريخ التنفيذ

# maximum_number_of_recurring_is
source: Maximum number of recurring is {max}
ar: الحد الأقصى لعدد مرات {max}التكرار هو

# account_type
source: {accountType} Account
ar: {accountType} حساب

source: You can add a beneficiary after making a transfer for quicker access next time.
ar: يمكنك إضافة مستفيد بعد إجراء تحويل لتسهيل الوصول في المرات القادمة.

source: ATM
ar: ماكينة الصراف الآلي

source: Branches
ar: الفروع

source: List View
ar: عرض القائمة

source: Selected
ar: محدد

source: Direction
ar: الاتجاه

source: Branches List
ar: قائمة الفروع

source: ATM List
ar: قائمة أجهزة الصراف الآلي

# open_till
source: Open {time}
ar: مفتوح {time}

# kilometers_away
source: {distance} Km away
ar: على بعد {distance} كم

# transfer_amount
source: {optional}Transfer amount:
ar: قيمة التحويل {optional}:

# transfer_date
source: {optional}Transfer date:
ar: تاريخ التحويل {optional}:

source: Next
ar: القادم

# new_text
source: New
ar: جديد

source: Cancel Schedule Transfer
ar: إلغاء الجدولة

source: Schedule Details
ar: تفاصيل التحويل المجدول

# schedule_transfer_empty_message
source: You don't have any scheduled transfers to display
ar: لا توجد أي تحويلات مجدولة لعرضها.

# schedule_cancellation_dialog_title
source: Schedule Cancellation
ar: إلغاء الجدولة

# schedule_cancellation_dialog_content
source: By canceling this scheduled transfer, all upcoming transfers won't be executed.
ar: بإلغاء هذا التحويل المجدول،جميع التحويلات القادمة لن يتم تنفيذها

source: Cancel Schedule
ar: إلغاء الجدولة

source: Interest rate is required
ar: يجب تحديد سعر الفائدة

source: Select Currency
ar: اختر العملة

# forget_pass_page_msg
source: To reset your password, please verify your details. We'll send a code to your registered mobile number.
ar: لإعادة تعيين كلمة المرور، يرجى التحقق من بياناتك. سنرسل رمزًا إلى رقم هاتفك المحمول المُسجل.

# scb_card_num
source: Card number
ar: رقم البطاقة البنكية

# card_pin_num
source: Card Pin Number
ar: الرقم السرى للبطاقة

# pin_msg_atm
source: This Pin is the password you use on the ATM
ar: هذا الرقم السري هو كلمة المرور التي تستخدمها في أجهزة الصراف الآلي.

source: Invalid card number
ar: رقم الكارت غير صحيح

# password_incorrect
source: Password is not correct
ar: الرقم السري غير صحيح

source: Successful reset!
ar: إعادة تعيين ناجحة!

# password_reset_successfully
source: The password is reset successfully.
ar: تم إعادة تعيين كلمة المرور بنجاح

# some_data_invalid
source: Some of the entered data is invalid, please re-check and try again.
ar: بعض من البيانات المدخلة غير صحيحة،برجاء التاكد والمحاولة مرة أخرى

# amount_must_be_less_than_max_due_amount
source: Amount must be less than {maxAmount}
ar: يجب أن يكون المبلغ أقل من {maxAmount}

# cant_show_nearby_branches_atm
source: Can't show nearby branches/ATMs
ar: لا يمكن عرض الفروع/أجهزة الصراف الآلي القريبة

# cant_show_nearby_branches_atm_info
source: We couldn't access your location. To view nearby branches and ATMs, please enable location services in your device settings.
ar: لم نتمكن من الوصول إلى موقعك. لعرض الفروع وأجهزة الصراف الآلي القريبة، يُرجى تفعيل خدمات الموقع من إعدادات جهازك.

source: Enable Location
ar: تفعيل الموقع

# x_results_found
source: {count} results found
ar: تم العثور على {count} نتائج

source: Connection Timeout
ar: مهلة الاتصال

source: Session expired
ar: انتهت الجلسة

# compromised_device_message
source: This device is rooted or jail-broken. For security reasons, you should not use this app. It will not work.
ar: هذا الجهاز مروّت أو مكسور الحماية. لأسباب أمنية، لا يجب استخدام هذا التطبيق. لن يعمل.

# compromised_device_title
source: Security Alert
ar: تنبيه أمني

# session_expired_message
source: Session has been expired, Please log in again to continue.
ar: انتهت صلاحية الجلسة. يُرجى تسجيل الدخول مرة أخرى للمتابعة.

source: Swift Code
ar: الرمز التعريفي للبنك

source: IBAN Number
ar: رقم IBAN

source: Copied successfully
ar: تم النسخ بنجاح

source: Copied
ar: تم النسخ

# disclaimer_cd
source: The minimum certificate amount is {amount}
ar: الحد الأدنى لقيمة الشهادة هو {amount}

# disclaimer_td
source: The minimum Time Deposit amount is {amount}
ar: الحد الأدنى لقيمة الوديعة هو {amount}

# select_leaves_number_to_proceed
source: Select the Leaves number to proceed
ar: يرجى اختيار عدد أوراق الشيكات للمتابعة

source: Authenticate to complete setup
ar: قم بالمصادقة لإكمال الإعداد

source: Authenticate to login
ar: قم بالمصادقة لتسجيل الدخول

# biometric_disabled_for_device_title
source: Biometric authentication disabled
ar: تم تعطيل تسجيل الدخول بالبصمة

# biometric_disabled_for_device_message
source: We have removed biometric login for this device because we noticed a login from another device.
ar: قمنا بإلغاء تسجيل الدخول بالبصمة لهذا الجهاز لأننا لاحظنا تسجيل دخول من جهاز آخر.

# x_leaves
source: {number} Leaves
ar: {number} صفحة

source: Please try again later
ar: اعد المحاوله في وقت اخر

# otp_code_sent_to_your_number_new
source: OTP code sent to your registered mobile number.
ar: تم إرسال رمز التحقق إلى رقم هاتفك المسجل.

# life_board_onboarding_sub_text
source: Easily view all your upcoming events in one smart board. Never miss a moment, deadline, or opportunity
ar: تابع كل فعالياتك في عرض ذكي وسهل الاستخدام.

source: Discover
ar: استكشف

# add_new_event_title
source: Add New Event
ar: إضافة فعالية جديدة

# event_details_title
source: Event Details
ar: تفاصيل الفعالية

# event_details_subtitle
source: Please enter the event name and select the date to create your new event.
ar: من فضلك أدخل اسم الفعالية واختر التاريخ لإنشاء فعالية جديدة.

# event_name_hint
source: Event name
ar: اسم الفعالية

# event_type_hint
source: Event type
ar: نوع الفعالية

# select_type_hint
source: Select Event Type
ar: اختر نوع الفعالية

# event_date_hint
source: Event date
ar: تاريخ الفعالية

# event_note_hint
source: Note (Optional)
ar: ملحوظة (إختياري)

# event_added_title
source: Event Added!
ar: تمت إضافة الفعالية!

# event_added_message
source: Your event is added successfully
ar: تمت إضافة الفعالية بنجاح

# done_button
source: Done
ar: تم

# this_field_required
source: This field is required
ar: هذا الحقل مطلوب

# update_event_button
source: Update Event
ar: تحديث الفعالية

# delete_event_button
source: Delete Event
ar: حذف الفعالية

# confirmDeletionTitle
source: Confirm Deletion
ar: تأكيد الحذف

# confirmDeletionSubtitle
source: Are you sure you want to delete this event?
ar: هل أنت متأكد أنك تريد حذف هذه الفعالية؟

source: Total Earning
ar: إجمالي الأرباح

source: Total Dues
ar: إجمالي المستحقات

# monthly_overview
source: Month Overview
ar: ملخص الشهر

# never_miss_thing
source: Never miss a thing!
ar: كن على اطلاع دائم!

# check_your_events
source: Check your upcoming events now
ar: اطلع على الفعاليات القادمة الخاصة بك

# welcome_to_lifeboard
source: Welcome to
ar: أهلاً بك في

source: Click to discover
ar: اضغط هنا لاستكشافها

# you_have_events
source: You have {count} events today
ar: لديك {count} فعاليات اليوم

# today_with_date
source: Today, {date}
ar: اليوم, {date}

source: Select Year
ar: اختر السنة

# could_not_load_events
source: We couldn't reload your events
ar: لم نتمكن من تحميل الفاعليات الخاصة بك

# you_have_no_events
source: You don't have any events for this month
ar: لا توجد أي فعاليات لهذا الشهر

source: {month} {year}
ar: {year} {month}

source: Add New Scheduled Transfer
ar: إضافة تحويل مجدول جديد

source: Birthday
ar: عيد ميلاد

source: Anniversary
ar: ذكرى

source: Other
ar: أخرى

source: App Language
ar: لغة التطبيق

# locale_language
source: English
ar: العربية

source: Total Available Balance
ar: إجمالى الرصيد المتاح

source: Deactivate Biometric Login
ar: إلغاء تفعيل الدخول بالبصمة

# deactivate_biometric_login_msg
source: Are you sure you want to deactivate biometric login?
ar: هل أنت متأكد أنك تريد إلغاء تفعيل الدخول بالبصمة؟

source: Deactivate
ar: إلغاء التفعيل

source: Biometric Login Deactivated Successfully
ar: تم إلغاء تفعيل الدخول بالبصمة بنجاح

source: Biometric activated successfully
ar: تم تفعيل الدخول بالبصمة بنجاح

source: Enable Biometric
ar: تفعيل الدخول بالبصمة

source: Biometric activation failed
ar: تعذر تفعيل تسجيل الدخول بالبصمة

source: Biometric deactivation failed
ar: تعذر إيقاف تسجيل الدخول بالبصمة

source: Face ID/Fingerprint
ar: بصمة الوجه / بصمة الإصبع

# january
source: Jan
ar: يناير

# february
source: Feb
ar: فبراير

# march
source: Mar
ar: مارس

# april
source: Apr
ar: ابريل

source: May
ar: مايو

# june
source: Jun
ar: يونيه

# july
source: Jul
ar: يوليو

# august
source: Aug
ar: أغسطس

# september
source: Sep
ar: سبتمبر

# october
source: Oct
ar: اكتوبر

# november
source: Nov
ar: نوفمبر

# december
source: Dec
ar: ديسمبر

source: Receive CD Interest
ar: استلام عائد الشهادة

source: Receive TD Interest
ar: استلام عائد الوديعة

source: Pay Loan Due
ar: سدد قسط القرض

source: Pay Credit Card Due
ar: سدّد مستحقات بطاقة الائتمان

source: Event updated successfully
ar: تم تحديث الفعالية بنجاح

source: Event deleted successfully
ar: تم حذف الفعالية بنجاح

# weeks_left
source: /{number} Weeks
ar: /{number} اسبوع

source: Maximum Limit Reached
ar: تم الوصول إلى الحد الأقصى

# maximum_limit_reached_message
source: You can select up to {number} quick actions only. To add a new one, please deselect an existing item.
ar: يمكنك اختيار ما يصل إلى {number} إجراءات سريعة فقط. لإضافة إجراء جديد، يرجى إلغاء تحديد أحد العناصر الحالية.

# minimum_limit_reached
source: Minimum Limit Not Reached
ar: الحد الأدنى غير مكتمل

# minimum_limit_reached_message
source: You need to select at least {number} quick actions to continue. Please choose more to proceed.
ar: يجب اختيار {number} إجراءات سريعة على الأقل للمتابعة. يرجى تحديد المزيد لإكمال الإعداد.

# you_have_events_today
source: You have {number} events today
ar: لديك {number} فعاليات اليوم

# soft_token_welcome_msg
source: Welcome to token activation you will make it in few steps
ar: مرحبًا بك في تفعيل الرمز، ستقوم بذلك خلال خطوات بسيطة.

# soft_token_activation_step_one_title
source: Get the Registration Code
ar: احصل على رمز التسجيل

# soft_token_activation_step_one_sub_title
source: Open the SCB Token app, follow the instructions and copy the registration code
ar: افتح تطبيق SCB Token، واتبع التعليمات، ثم انسخ رمز التسجيل.

# soft_token_activation_step_two_title
source: Paste the code
ar: الصق الرمز

# soft_token_activation_step_two_sub_title
source: Return here to SCB mobile to paste the registration code
ar: عد إلى تطبيق SCB موبايل للصق رمز التسجيل.

# soft_token_activation_step_three_title
source: Complete Activation
ar: إكمال التفعيل

# soft_token_activation_step_three_sub_title
source: Click continue on the token app then back here to complete activation
ar: اضغط على "متابعة" في تطبيق الرمز، ثم عد إلى هنا لإكمال التفعيل.

source: View Demo
ar: شاهد الفديو

# soft_token_support
source: Need more support?
ar: لمزيد من الدعم؟

# step_of
source: Step {currentStep} of {totalSteps}
ar: الخطوة {currentStep} من {totalSteps}

# get_registration_code
source: Enter Registration Code
ar: أدخل رمز التسجيل

# get_your_registration_code
source: Open the soft token app, copy the registration code and paste it here
ar: افتح تطبيق التوكن الإلكتروني، وانسخ رمز التسجيل، ثم الصقه هنا.

# soft_token_get_registration_code_msg
source: Open the SCB Token app, copy the registration code, and return here to paste it.
ar: افتح تطبيق SCB Token، وانسخ رمز التسجيل، ثم ارجع إلى هنا للصقه.

source: Complete Activation
ar: إكمال التفعيل

# complete_activation_msg
source: Continue on your soft token app the following process
ar: تابع الخطوات التالية في تطبيق التوكن الإلكتروني الخاص بك.

source: SCB Token app
ar: SCB Token تطبيق

source: Open app
ar: فتح التطبيق

# soft_token_app_tapped_confirmation
source: Yes, I've tapped "Continue" in the SCB Token app
ar: نعم، لقد ضغطت على "متابعة" في تطبيق SCB Token.

# soft_token_app_tapped_confirmation_msg
source: This confirms you've finished setup inside SCB Token app.
ar: هذا يؤكد أنك أتممت الإعداد داخل تطبيق SCB Token.

# soft_token_activation_in_few_steps
source: Token activation in few steps
ar: تفعيل الرمز، ستقوم بذلك خلال خطوات بسيطة.

# ok_got_it
source: Okay, got it
ar: حسنًا، فهمت.

# download_scb_soft_token_app
source: Download Soft Token App
ar: حمّل تطبيق Soft Token

# copy_following_code
source: Copy the Following
ar: قم بنسخ التالي

# copy_following_code_msg
source: Please insert the activation code and serial number in the soft token app
ar: يرجى إدخال رمز التفعيل والرقم التسلسلي في تطبيق التوكن الإلكتروني.

# download_scb_soft_token_app_msg
source: Use the SCB Token app to activate your token.
ar: استخدم تطبيق SCB Token لتفعيل رمز الامان الخاص بك.

source: Download and Install now
ar: حمّل وثبّت الآن

# soft_token_activation_confirmation_error_msg
source: Please confirm token activation before continuing.
ar: يرجى تأكيد تفعيل التوكن قبل المتابعة.

# soft_token_closing_confirmation_msg
source: Closing will discard your changes
ar: الخروج الآن سيُلغي كل التعديلات التي أجريتها.

# go_to_scb_app
source: Go to SCB token app
ar: اذهب الي التطبيق

source: App Settings
ar: إعدادات التطبيق

source: User Settings
ar: إعدادات المستخدم

# language_title
source: Language
ar: لغة التطبيق

source: Inactive
ar: غير مُفعل

source: Missing Information
ar: معلومات مفقودة

# login_missing_information_msg
source: Please enter both your username and password to log in.
ar: يرجى إدخال كلٍّ من اسم المستخدم وكلمة المرور لتسجيل الدخول.

# user_name_missing
source: Username is missing
ar: اسم المستخدم مفقود

# user_name_missing_msg
source: Please enter username to log in.
ar: يرجى إدخال اسم المستخدم لتسجيل الدخول.

# password_missing
source: Password is missing
ar: كلمة المرور مفقودة

# password_missing_msg
source: Please enter password to log in.
ar: يرجى إدخال كلمة المرور لتسجيل الدخول.
