Repository: Ahmed-Abdelhamid0/RealTime-DB-with-Notification
Catalog: lib/l10n/app_*.arb
Languages: ar

# app_name
source: Suez Canal Bank
ar: بنك قناة السويس

source: Sorry!
ar: عذرا!ً

# check_internet_connection
source: kindly check your network setting
ar: يرجى التحقق من إعدادات الشبكة

# no_internet
source: No Internet Connection
ar: لا يوجد اتصال بالإنترنت

# language
source: العربية
ar: English

source: Username
ar: اسم المستخدم

# welcome_to
source: Welcome!
ar: مرحبا بك!

source: Password
ar: كلمة المرور

# help_soft_token
source: Help
ar: مساعدة

source: Forgot password?
ar: نسيت كلمة المرور؟

# forgot_password_title
source: Forgot password
ar: نسيت كلمة المرور

source: Log in
ar: تسجيل الدخول

# user_name_required
source: Username is required
ar: اسم المستخدم مطلوب

# user_name_must_be
source: username must be of 8 to 20 characters.
ar: يجب أن يتكون اسم المستخدم من 8 إلى 20 حرفًا.

# password_required
source: Password is required
ar: كلمة المرور مطلوبة

source: Account locked
ar: الحساب مقفل

# account_locked_content
source: You've exceeded the maximum number of login attempts. For your security, your account has been locked. Please reset your password
ar: لقد تجاوزت الحد الأقصى لمحاولات تسجيل الدخول. لأمان حسابك، تم قفله. يرجى إعادة تعيين كلمة المرور

source: Unlock account
ar: إعادة فتح الحساب

source: Reset password
ar: إعادة تعيين كلمة المرور

source: Cancel
ar: تراجع

source: Password expired
ar: انتهت صلاحية كلمة المرور

# password_expired_content
source: Your password has expired. Please reset it to continue accessing your account
ar: انتهت صلاحية كلمة المرور الخاصة بك. يرجى إعادة تعيينها للاستمرار في الوصول إلى حسابك

source: Update Password
ar: تحديث كلمة المرور

source: Already Logged In
ar: مسجل الدخول بالفعل

# already_logged_in_content
source: You're currently signed in on another device. To continue here, we'll log you out from the other
ar: أنت مسجل الدخول حاليًا على جهاز آخر. للمتابعة هنا، سنقوم بتسجيل خروجك من الجهاز الآخر

# continue_button
source: Continue
ar: متابعة

# invalid_username
source: Invalid username or password
ar: اسم المستخدم أو كلمة المرور غير صحيحة

# invalid_username_content
source: Please check your login details and try again.
ar: يرجى التحقق من تفاصيل تسجيل الدخول والمحاولة مرة أخرى.

# inactive_user
source: User inactive
ar: المستخدم غير نشط

# inactive_user_content
source: This registered user hasn't been active for a while.
ar: هذا المستخدم المسجل من قبل لم يكن نشطاً لفترة من الوقت.

# activate
source: Active
ar: مُفعل

source: Error
ar: خطأ

source: Page not found
ar: الصفحة غير موجودة

source: Login failed
ar: فشل تسجيل الدخول

# invalid_code
source: Invalid OTP, please click on resend code
ar: رمز التحقق غير صحيح، يرجى النقر على إعادة إرسال الرمز

# attempts_left
source: {count} attempts left
ar: تبقى {count} محاولات

# max_attempts_exceeded
source: You have exceeded the maximum number of invalid OTP attempts. Please, contact the bank for further assistant
ar: لقد تجاوزت الحد الأقصى لعدد محاولات رمز التحقق غير الصالحة

source: Resend Code
ar: إعادة إرسال الرمز

# resend_code_timer
source: {seconds} s
ar: {seconds} ثانية

source: Help
ar: المساعدة

source: Verification
ar: التحقق

# otp_sent_message
source: OTP code sent to your registered mobile number.
ar: تم إرسال رمز التحقق إلى رقم هاتفك المسجل.

source: New Password
ar: كلمة المرور

source: Confirm new password
ar: تأكيد كلمة المرور

# register_new_user_header
source: Enter unique username and password. keep them confidential. you will need them for future logins.
ar: إختر اسم مستخدم وكلمة مرور. احفظهما بشكل سري، ستحتاج إليهما لتسجيل الدخول لاحقًا.

# validation_length_characters
source: 8 - 64 characters
ar: 8 إلى 64 حرفًا

# validation_number
source: At least 1 number
ar: على الأقل رقم واحد

# validation_upper_lower
source: At least 1 upper and lowercase character
ar: يجب أن تحتوي على حرف كبير وحرف صغير على الأقل

# validation_special_character
source: At least 1 special character
ar: على الأقل رمز خاص واحد

# password_should_contains
source: Password should contains the following:
ar: يجب أن تحتوي كلمة المرور على ما يلي:

source: Strong
ar: قوي

source: Weak
ar: ضعيف

source: Medium
ar: متوسط

# confirm_password_required
source: Confirm Password is required
ar: تأكيد كلمة المرور مطلوب

# confirm_password_match_password
source: Confirm password not match password
ar: تأكيد كلمة المرور لا تطابق كلمة المرور

# password_not_valid
source: Password is invalid
ar: كلمة المرور غير صالحة

# password_not_valid_register
source: Password must be stronger and not easily guessable
ar: يجب أن تكون كلمة المرور قوية وغير سهلة التخمين

# banking_made_easy
source: Banking Made Easy – Start Your Journey Now!
ar: معاملاتك البنكية أبسط وأسرع – ابدأ الآن!

# select_registration_method
source: Select a Registration Method to Get Started.
ar: اختر طريقة التسجيل للبدء.

source: CIF number
ar: الرقم التعريفي CIF

source: Account number
ar: رقم الحساب

source: Account number/IBAN
ar: رقم الحساب/الآيبان

source: Card number
ar: رقم بطاقة الخصم المباشر

# enter_cif_info
source: Enter this information to verify your account.
ar: أدخل هذه المعلومات للتحقق من حسابك.

# cif_number_hint
source: You can find your customer information file number (CIF) in your bank statements or by contacting customer support at {number}.
ar: يمكنك العثور على رقم ملف معلومات العميل (CIF) في كشوفات البنك الخاصة بك أو من خلال التواصل مع خدمة العملاء على الرقم {number}.

# national_id_number
source: National ID / Passport number
ar: الرقم القومي / رقم جواز السفر

# cif_number_required
source: CIF number is required
ar: الرقم التعريفيCIF مطلوب

# card_number_required
source: Card number is required
ar: رقم البطاقة مطلوب

# account_number_required
source: Account number is required
ar: رقم الحساب مطلوب

# national_id_required
source: National ID / Passport number is required
ar: رقم بطاقة الرقم القومي/ رقم جواز السفر مطلوب

source: Contact Bank
ar: التواصل مع البنك

source: Register new user
ar: تسجيل مستخدم جديد

# terms_and_conditions
source: Terms & Conditions
ar: الشروط والأحكام

# terms_and_conditions_description
source: Please read & accept the terms and conditions to continue registration.
ar: يرجى قراءة وقبول الشروط والأحكام لمتابعة التسجيل.

# i_have_read_and_agree
source: I have read and agree to terms & conditions
ar: لقد قرأت وأوافق على الشروط و الأحكام

# terms_and_conditions_agreement
source: I have read and agree to
ar: لقد قرأت وأوافق على

source: Failed to load terms
ar: فشل في تحميل الشروط

source: New user?
ar: مستخدم جديد؟

source: Register
ar: تسجيل

# terms_agreement_required
source: You need to agree to the terms and conditions to continue.
ar: يجب عليك الموافقة على الشروط والأحكام للاستمرار

source: Ok
ar: تم

source: Okay
ar: حسنا

source: Update Now
ar: تحديث الآن

source: Update
ar: تحديث

source: Later
ar: لاحقاً

# retry_otp_layer
source: You have recently resend the OTP, Please retry after 88 seconds
ar: لقد قمت مؤخرًا بإعادة إرسال رمز OTP، يرجى المحاولة مرة أخرى بعد 88 ثانية

source: Attention!
ar: تنبيه!

# undergoing_maintenance
source: We are currently undergoing maintenance.
ar: نحن حاليًا نقوم بأعمال الصيانة.

# our_service_will_be_back_up
source: Our service will be back up and running soon!
ar: ستعود خدمتنا للعمل قريبًا!

source: Loading...
ar: جاري التحميل...

source: Confirm Exit
ar: تأكيد الخروج

# exit_message
source: Do you really want to exit the app?
ar: هل تريد حقًا الخروج من التطبيق؟

source: Exit
ar: خروج

source: Done
ar: تم

# success_register_message_title
source: Registration Completed!
ar: تم التسجيل بنجاح!

# success_activation_message_title
source: Activation Completed!
ar: تم التسجيل بنجاح!

# success_register_message_body
source: Your account is set up. Access your banking services securely anytime.
ar: تم إعداد حسابك. يمكنك الوصول إلى خدماتك المصرفية بأمان في أي وقت.

# card_pin_hint
source: It is the card’s 4-digit code entered over the atm
ar: هو الرقم المكون من 4 أرقام الذي يتم إدخاله عبر ماكينة الصراف الآلي

source: Card PIN
ar: الرقم السري للبطاقة

# card_pin_required
source: Card PIN is required
ar: الرقم السري للبطاقة مطلوب

source: Home
ar: الرئيسية

source: Transfer
ar: تحويل

source: Cards
ar: البطاقات

source: Menu
ar: القائمة

source: Logout
ar: تسجيل الخروج

# please_sign_in_first
source: Please sign in first to use biometrics.
ar: يرجى تسجيل الدخول أولاً للاستخدام

source: Username
ar: اسم المستخدم

source: Hi,
ar: اهلاً،

source: Transfers
ar: التحويلات

source: Pay Bills
ar: دفع الفواتير

source: Converter
ar: المحول

source: Add new
ar: إضافة جديد

source: Current Account
ar: الحساب الجاري

source: Current Accounts
ar: الحسابات الجارية

source: Total Amount
ar: إجمالي المبلغ

source: Accounts
ar: الحسابات

source: EGP
ar: جنيه مصري

# cd_and_td
source: Certificates & Time deposits
ar: شهادات و ودائع

# cer_of_deposit
source: Certificate of deposit
ar: شهادة الإيداع

source: Time of deposit
ar: الوديعة الزمنية

source: Weekend Saver
ar: مدخر نهاية الأسبوع

source: Name
ar: اسم

source: Loans & Overdraft
ar: القروض و الجاري مدين

source: Next due date:
ar: تاريخ الاستحقاق:

source: Available limit
ar: الرصيد المتاح

source: Available Balance
ar: الرصيد المتاح

source: Debit card number
ar: رقم بطاقة الخصم المباشر

source: Credit card
ar: بطاقة الائتمان

source: Gold
ar: ذهبي

source: Platinum
ar: بلاتيني

source: View all
ar: عرض الكل

source: Loan Name
ar: اسم القرض

source: Next due amount:
ar: قيمة المستحق التالي:

source: Apply for new
ar: التقديم علي جديد

source: Certificate Name
ar: اسم الشهادة

source: Open new account
ar: فتح حساب جديد

source: Next interest amount:
ar: مبلغ الربح التالي:

source: Next interest date:
ar: تاريخ الربح التالي:

source: Interest Date
ar: تاريخ الفائدة

source: Total Balance
ar: إجمالي الرصيد

# transaction
source: Transactions
ar: العمليات

source: Successful
ar: ناجح

source: Hot deal
ar: عرض جديد

# buy_one_desc
source: Buy one get one 50%
ar: اشترِ واحدًا واحصل على الثاني بخصم 50%

source: days
ar: أيام

source: Offers
ar: العروض

source: All offers
ar: كل العروض

# no_recent_transactions
source: No recent transfer
ar: لا يوجد تحويلات حديثة

# could_not_load_transactions
source: we couldn{shortcut}t load transfers list
ar: لم نتمكن من تحميل التحويلات

source: Reload
ar: إعادة تحميل

source: Quick actions
ar: إجراءات سريعة

# quick_actions_sub_title
source: Customize your quick actions by removing or reordering items.
ar: قم بتخصيص إجراءاتك السريعة عن طريق إزالة المزيد أو إضافتها

source: Pay credit
ar: سداد بطاقة الائتمان

source: Donate
ar: تبرعات

source: Exchange rate:
ar: سعر الصرف:

source: Open TD
ar: طلب فتح وديعة

source: Open CD
ar: طلب فتح سهادة

source: Open Account
ar: طلب فتح حساب

source: Request Chequebook
ar: طلب دفتر شيكات

source: Locate Us
ar: موقعنا

source: Support
ar: الدعم

source: Something went wrong!
ar: حدث خطأ ما!

# we_could_not_load_terms_and_conditions
source: we couldn’t load terms and conditions
ar: لم نتمكن من تحميل الشروط والأحكام

source: Search
ar: البحث

source: Beneficiaries
ar: المستفيدون

# soft_tokens
source: Soft Token
ar: رمز الأمان

source: More
ar: المزيد

source: Management
ar: الإدارة

source: Settings
ar: الإعدادات

# activate_tokens
source: Activate your token
ar: تفعيل رمز الأمان

# welcome_to_online_transfer
source: Welcome to our online transfer service, you can now transfer to any bank in Egypt. As using this service require the download of soft token via App store or play store
ar: مرحبًا بك في خدمة التحويل عبر الإنترنت، يمكنك الآن التحويل إلى أي بنك في مصر. يتطلب استخدام هذه الخدمة تنزيل الرمز الناعم عبر App Store أو Play Store

source: To download the App
ar: لتحميل التطبيق

source: Click here
ar: اضغط هنا

# please_insert_generated_code
source: Please insert the registration code generated from SCB Token
ar: الرجاء إدخال رمز التسجيل الناتج من SCB Token

source: Generate my token
ar: طلب رمز الآمان

# please_insert_activation
source: Please insert Activation Code and serial Number in SCB Token Application at your mobile
ar: الرجاء إدخال رمز التفعيل والرقم التسلسلي في تطبيق SCB Token على هاتفك المحمول

source: Serial number
ar: الرقم التسلسلي

# your_activation_code_is
source: Activation code
ar: رمز التفعيل الخاص بك

# enter_register_code
source: Enter your Registration code
ar: أدخل رمز التسجيل

# register_code
source: Registration code
ar: رمز التسجيل

# success_register_tokens_content
source: Your token is successfully activated. you can perform transaction now
ar: تم تفعيل رمز الأمان بنجاح. يمكنك إجراء المعاملة الآن

# you_must_activate_soft_tokens
source: You must activate soft tokens first to add beneficiary
ar: يجب عليك تفعيل الرموز البرمجية أولاً لإضافة المستفيد

source: Activate soft tokens
ar: تفعيل

source: Soft tokens already activated
ar: تم تفعيل الرموز البرمجية بالفعل

source: Manage Beneficiaries
ar: إدارة المستفيدين

source: Beneficiary List
ar: قائمة المستفيدين

# currently_dn_have_any_beneficiary
source: Currently you don’t have any beneficiary
ar: حالياً ليس لديك أي مستفيد

# one_day_remaining
source: {days} day left
ar: {days} يوم متبقي

# days_remaining
source: {days} days left
ar: {days} ايام متبقية

# days_v2_remaining
source: {days} days left
ar: {days} يوم متبقي

source: Expires today
ar: ينتهي اليوم

# expired_days_ago
source: Expired {days} days ago
ar: انتهت منذ {days} أيام

# no_recent_offer
source: No recent offers yet
ar: لا توجد عروض حديثة بعد

# could_not_load_offers
source: we couldn’t load offers list
ar: تعذّر تحميل قائمة العروض

# could_not_load_accounts
source: we couldn’t load accounts list
ar: تعذّر تحميل قائمة الحسابات

# add_new_section
source: Add new sections
ar: إضافة أقسام جديدة

source: Edit dashboard
ar: تعديل الصفحة الرئيسية

# edit_dashboard_header
source: Customize your dashboard
ar: هل تريد إعادة الترتيب؟

# edit_dashboard_header_content
source: Hold and drag to reorder sections or cards. Hide what you don’t need for a cleaner view.
ar: فقط اضغط واسحب لإعادة ترتيب القسم أو أي بطاقة داخله، أو إخفائها من الصفحة الرئيسية!ً

source: Hide section
ar: إخفاء القسم

source: Hide
ar: إخفاء

source: Show more cards
ar: عرض المزيد من البطاقات

source: Show more accounts
ar: عرض حسابات أخرى

source: Show more loans
ar: عرض المزيد من القروض

source: Show more deposits
ar: عرض المزيد من الودائع

source: Show more offers
ar: عرض المزيد من العروض

source: Show more transactions
ar: عرض المزيد من المعاملات

source: Own Accounts
ar: حساباتي

source: Within SCB
ar: داخل البنك

source: Local
ar: محلي

source: New Transfer
ar: تحويل جديد

source: Transfer History
ar: ارشيف التحويل

# transfer_disclaimer
source: Transfers submitted after 3:00 PM will be processed on the next business day.
ar: سيتم تنفيذ التحويلات المقدمة بعد الساعة 3:00 PM في يوم العمل التالي.

source: Schedule Transactions
ar: جدولة التحويلات

# top_pick_for_you
source: Top Picks for You
ar: أفضل الاختيارات لك

source: Account
ar: حساب بنكى

source: Wallet
ar: محفظة

source: Mobile
ar: الهاتف المحمول

source: Edit
ar: تعديل

source: View more
ar: عرض المزيد

source: View less
ar: عرض اقل

# currently_you_dn_have_any_beneficiary
source: Currently you don’t have any beneficiary
ar: حاليًا، ليس لديك أي مستفيدين

# could_not_load_beneficiaries
source: we couldn{shortcut}t load beneficiaries list
ar: لم نتمكن من تحميل مستفيدين

source: Edit Beneficiary
ar: تعديل المستفيد

source: Save Updates
ar: تحديث

source: Delete Beneficiary
ar: حذف المستفيد

source: Beneficiary Nickname
ar: الإسم المستعار

source: Bank Name
ar: اسم البنك

source: Delete
ar: حذف

source: Confirm Deletion
ar: تأكيد الحذف

# confirm_deletion_msg
source: Are you sure you want to delete this beneficiary from favorite list?
ar: هل أنت متأكد أنك تريد حذف هذا المستفيد من القائمة؟

# beneficiary_deleted_msg
source: Beneficiary deleted successfully
ar: تم حذف المستفيد بنجاح

# beneficiary_updated_msg
source: Beneficiary list has been updated
ar: تم تحديث قائمة المستفيدين

source: Confirm
ar: تأكيد

source: Summary
ar: مراجعة التفاصيل

source: Amount
ar: المبلغ

# amount_required
source: Minimum transfer amount is 1
ar: المبلغ الأدنى للتحويل هو 1

# from_required
source: Select from account to proceed
ar: اختر الحساب المرسل للمتابعة

# to_required
source: Select to account to proceed
ar: اختر الحساب المستلم للمتابعة

source: Transfer Limits
ar: حدود التحويل

source: Date:
ar: التاريخ:

source: Reference:
ar: الرقم المرجعي:

source: Schedule Transfer
ar: تحويل مجدول

source: From
ar: من

source: To
ar: إلى

source: Select account
ar: اختر الحساب

source: Transfer Successful!
ar: تم التحويل بنجاح!

source: Rate
ar: السعر

source: Add to Quick Transfer
ar: أضف إلى التحويل السر

# add_to_quick_beneficiary
source: Add to Beneficiary
ar: إضافة إلى المستفيدون

source: Activated
ar: تم التفعيل

source: Not Activated
ar: غير مُفعل

source: Not Registered
ar: غير مُسجّل

# registration_code_invalid
source: Registration code is invalid.
ar: رقم التسجيل غير صحيح

source: Nick name
ar: الاسم المستعار

# note_optional
source: Notes (Optional)
ar: ملاحظات (اختيارى)

# account_number_less_16
source: Account number must be 16 digits.
ar: رقم الحساب يجب أن يكون 16 رقماً

source: Nick name required
ar: الاسم المستعار مطلوب

# note
source: Notes (Optional)
ar: ملاحظات (اختيارى):

source: Notes:
ar: ملاحظات:

source: Notes
ar: ملاحظات

source: Share
ar: مشاركة

source: Send Money To
ar: إرسال الأموال إلى

source: Card
ar: بطاقة

source: Token activation
ar: تفعيل رمز الأمان

# token_activation_msg
source: Soft token needs to be activated first to proceed
ar: رمز الامان يجب تفعيله أولاً للمتابعة

# transfer_limit_exceeded
source: Transfer limit is exceeded
ar: تم تجاوز حد التحويل

source: Update Available
ar: التحديث متاح

# new_version_available
source: A new version is available. We recommend updating for the best experience.
ar: يتوفر إصدار جديد. نوصي بالتحديث للحصول على أفضل تجربة.

# update_upper_cased
source: UPDATE
ar: تحديث

source: Update Required
ar: التحديث مطلوب

source: Add
ar: إضافة

# beneficiary_added_msg
source: Beneficiary added successfully
ar: تم إضافة المستفيد بنجاح

source: No beneficiaries yet
ar: لا يوجد مستفدين حتى الآن

# once_you_add_beneficiary_they_will_show
source: Once you add a beneficiary, they{shortcut}ll show up here.
ar: بمجرد إضافة المستفيد، سيظهر هنا.

source: No matches found
ar: لا يوجد تطابقات

# try_search_with_different_keyboard
source: Try searching with different keywords.
ar: حاول البحث بأحرف محتلفة

source: Search...
ar: بحث...

# nick_name_characters_error_msg
source: Nickname must be 2-35 characters
ar: يجب أن يكون الاسم المستعار من 2 إلى 35 حرفًا

# a_new_version_available
source: A new version of the app is available! Update to latest version for new features and improvements.
ar: نسخة جديدة من التطبيق متاحة الآن! يمكنك تحديث التطبيق للتمتع بالمزايا والتحسينات الجديدة.

# app_no_longer_supported
source: Your app version is outdated and no longer supported. Please update to continue using the app.
ar: نسخة تطبيقك قديمة ولم تعد مدعومة، يرجى التحديث للاستمرار في استخدام التطبيق.

# we_could_not_load_you_list
source: We couldn’t reload your list
ar: لم نتمكن من تحميل القائمة

# we_could_not_load_the_list
source: We couldn{shortcut}t reload the list
ar: لم نتمكن من تحميل القائمة

source: Transfer not available
ar: التحويل غير متاح

# transfer_between_own_accounts
source: Transfer between own accounts is currently not available due to having single account.
ar: التحويل بين الحسابات الخاصة غير متاح حاليًا نظرًا لامتلاكك حساب واحد فقط

source: Cancel Transfer
ar: إلغاء التحويل

# cancel_transfer_content
source: Are you sure you want to close this screen? Any entered details will be lost.
ar: هل أنت متأكد أنك تريد إلغاء التحويل؟ سيتم فقدان أي بيانات أدخلتها.

source: Yes
ar: نعم

source: Transfer Type
ar: نوع التحويل

source: Transfer type
ar: نوع التحويل

source: Credited amount:
ar: المبلغ المحول:

source: Own
ar: شخصى

# account_number_invalid
source: Account number/IBAN is invalid.
ar: رقم الحساب / الآيبان غير صحيح.

# card_number_invalid
source: Card number is invalid.
ar: رقم البطاقة غير صحيح

# card_number_register_invalid
source: Card number is invalid.
ar: رقم البطاقة غير صالح

# card_pin_invalid
source: Card PIN is invalid
ar: الرقم السري للبطاقة غير صالح

# could_not_load_transfer_history
source: We couldn't load your Transfer history
ar: لم نتمكن من تحميل التحويلات السابقة

source: No Transfers
ar: لا التحويلات

source: Own Account
ar: الحساب الخاص

source: Recent Transfers
ar: التحويلات الأخيرة

source: Transfers History
ar: تاريخ التحويلات

source: Normal
ar: عادي

# ipn_instant
source: Instant Transfer IPN
ar: تحويل لحظي

source: Payment Address
ar: عنوان الدفع

source: Account/IBAN
ar: حساب بنكى

source: Local Transfer
ar: محلى

source: Select bank
ar: اختر البنك

source: Beneficiary name
ar: اسم المستفيد

source: Beneficiary Name
ar: اسم المستفيد

# bank_name_required
source: Bank name is required
ar: اسم البنك مطلوب

# beneficiary_name_required
source: Beneficiary name is required
ar: اسم المستفيد مطلوب

source: Transfer details
ar: تفاصيل التحويل

source: Repeat transfer
ar: تكرار التحويل

source: Scheduled
ar: مجدولة

source: Select Date Range
ar: اختر مدة زمنية

source: Apply
ar: تقديم

source: Start Date
ar: تاريخ البداية

source: End Date
ar: تاريخ الانتهاء

source: Request a card
ar: طلب بطاقة

source: Available balance is insufficient
ar: الرصيد المتاح غير كاف

source: Due Amount:
ar: المبلغ المستحق:

source: Due Date:
ar: تاريخ الاستحقاق:

source: Card Details
ar: تفاصيل البطاقة

source: Pay Card
ar: سداد البطاقة

source: Today
ar: اليوم

source: Last week
ar: آخر أسبوع

source: Last month
ar: آخر شهر

source: Last 3 months
ar: آخر 3 شهور

source: Select Date
ar: اختر التاريخ

source: Card Transactions
ar: معاملات البطاقة

source: Card limit
ar: حد البطاقة

source: No transactions yet
ar: لا يوجد معاملات

# we_could_not_load_your_transactions
source: We couldn't load your transactions
ar: لم نتمكن من تحميل معاملاتك

# otp_code_sent_to_your_number
source: Please enter the OTP from your SCB token app.
ar: برجاء إدخال رمز الأمان من تطبيق SCB Token.

source: Amount or name
ar: الاسم او المبلغ

# this_fields_accept_2_char
source: This field accepts minimum 2 letters
ar: هذا الحقل يقبل حرفين كحد أدنى

# transfer_error
source: We couldn't complete your transfer due to an unexpected error. Please try again later.
ar: لم نتمكن من إتمام عملية التحويل بسبب خطأ غير متوقع. يُرجى المحاولة مرة أخرى لاحقًا.

source: Enable
ar: تفعيل

source: Disable
ar: إلغاء التفعيل

source: Account Details
ar: تفاصيل الحساب

source: Open New Deposit
ar: فتح شهادة/وديعة جديدة

source: Interest Rate
ar: معدل الفائدة

source: Pending Amount
ar: المبلغ المعلق

# loan_details
source: Loans Details
ar: تفاصيل القروض

source: Details
ar: التفاصيل

source: Next Installment Amount
ar: قيمة القسط القادم

source: Next Installment Date
ar: تاريخ القسط القادم

source: Paid Installments
ar: الأقساط المدفوعة

source: Remaining
ar: متبقى

source: Installment Frequency
ar: تكرار الأقساط

source: Fixed Rate
ar: معدل الفائدة

source: Maturity Left
ar: المدة المتبقية

source: Collateral Type
ar: نوع الضمانة

source: Issued Date
ar: تاريخ الإصدار

source: Loan Payments
ar: مدفوعات القرض

source: Loan Payment
ar: سداد القرض

source: Upcoming
ar: القادم

source: Paid
ar: تدفع

# due
source: Overdue
ar: متأخر

source: Request Chequebook
ar: طلب دفتر شيكات

source: Services
ar: الخدمات

source: Select number
ar: اختر الرقم

source: Page
ar: صفحة متبقية

source: Fees
ar: الرسوم

# select_account_required_msg
source: Select account is required
ar: يرجى اختيار الحساب

# select_leaves_error_msg
source: Select the Leaves number to proceed
ar: يرجى اختيار عدد أوراق الشيكات للمتابعة

# need_agree_terms
source: You need to agree to the terms and conditions to continue.
ar: يجب أن توافق على الشروط والأحكام للاستمرار.

source: Submitted Successfully!
ar: تم التقديم بنجاح!

source: Pages Cheques
ar: صفحة

source: More Details
ar: مزيد من التفاصيل

source: Request Status
ar: حالة الطلب

source: Current
ar: جارى
